MikroElektronika/core_packages/ARM/gcc_clang/startup/toshiba/tmpm4g9f10fg.S
                adds     r4, #12
                b        .L_loop0
.L_loop0_done:

                ldr      r3, =__zero_table_start__
                ldr      r4, =__zero_table_end__

.L_loop2:
                cmp      r3, r4
                bge      .L_loop2_done
                ldr      r1, [r3]
                ldr      r2, [r3, #4]
                movs     r0, 0

.L_loop2_0:
                subs     r2, #4
                itt      ge
                strge    r0, [r1, r2]
                bge      .L_loop2_0

                adds     r3, #8
                b        .L_loop2
.L_loop2_done:

                bl       _start

                .fnend
                .size    Reset_Handler, . - Reset_Handler

/* The default macro is not used for HardFault_Handler
 * because this results in a poor debug illusion.
 */
                .thumb_func
                .type    HardFault_Handler, %function
                .weak    HardFault_Handler
                .fnstart
HardFault_Handler:
                b        .
                .fnend
                .size    HardFault_Handler, . - HardFault_Handler

                .thumb_func
                .type    Default_Handler, %function
                .weak    Default_Handler
                .fnstart
Default_Handler:
                b        .
                .fnend
                .size    Default_Handler, . - Default_Handler

/* Macro to define default exception/interrupt handlers.
 * Default handler are weak symbols with an endless loop.
 * They can be overwritten by real handlers.
 */
                .macro   Set_Default_Handler  Handler_Name
                .weak    \Handler_Name
                .set     \Handler_Name, Default_Handler
                .endm


/* Default exception/interrupt handler */

                Set_Default_Handler  NMI_Handler
                Set_Default_Handler  MemManage_Handler
                Set_Default_Handler  BusFault_Handler
                Set_Default_Handler  UsageFault_Handler
                Set_Default_Handler  SVC_Handler
                Set_Default_Handler  DebugMon_Handler
                Set_Default_Handler  PendSV_Handler
                Set_Default_Handler  SysTick_Handler

                Set_Default_Handler  INT00_Handler
                Set_Default_Handler  INT01_Handler
                Set_Default_Handler  INT02_Handler
                Set_Default_Handler  INT03_Handler
                Set_Default_Handler  INT04_Handler
                Set_Default_Handler  INT05_Handler
                Set_Default_Handler  INT06_Handler
                Set_Default_Handler  INT07_Handler
                Set_Default_Handler  INT08_Handler
                Set_Default_Handler  INT09_Handler
                Set_Default_Handler  INT10_Handler
                Set_Default_Handler  INT11_Handler
                Set_Default_Handler  INT12_Handler
                Set_Default_Handler  INT13_Handler
                Set_Default_Handler  INT14_Handler
                Set_Default_Handler  INT15_Handler
                Set_Default_Handler  INTRTC_Handler
                Set_Default_Handler  INTCEC0RX_Handler
                Set_Default_Handler  INTCEC0TX_Handler
                Set_Default_Handler  INTISDA_Handler
                Set_Default_Handler  INTISDB_Handler
                Set_Default_Handler  INTISDC_Handler
                Set_Default_Handler  INTRMC0_Handler
                Set_Default_Handler  INTRMC1_Handler
                Set_Default_Handler  INTLTTMR_Handler
                Set_Default_Handler  INTHDMAATC_Handler
                Set_Default_Handler  INTHDMAAERR_Handler
                Set_Default_Handler  INTHDMABTC_Handler
                Set_Default_Handler  INTHDMABERR_Handler
                Set_Default_Handler  INTMDMAATC_Handler
                Set_Default_Handler  INTT32A00_A_CT_Handler
                Set_Default_Handler  INTT32A00_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A01_A_CT_Handler
                Set_Default_Handler  INTT32A01_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A02_A_CT_Handler
                Set_Default_Handler  INTT32A02_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A03_A_CT_Handler
                Set_Default_Handler  INTT32A03_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A04_A_CT_Handler
                Set_Default_Handler  INTT32A04_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A05_A_CT_Handler
                Set_Default_Handler  INTT32A05_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A06_A_CT_Handler
                Set_Default_Handler  INTT32A06_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A07_A_CT_Handler
                Set_Default_Handler  INTT32A07_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A08_A_CT_Handler
                Set_Default_Handler  INTT32A08_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A09_A_CT_Handler
                Set_Default_Handler  INTT32A09_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A10_A_CT_Handler
                Set_Default_Handler  INTT32A10_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A11_A_CT_Handler
                Set_Default_Handler  INTT32A11_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A12_A_CT_Handler
                Set_Default_Handler  INTT32A12_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A13_A_CT_Handler
                Set_Default_Handler  INTT32A13_B_C01_CPC_Handler
                Set_Default_Handler  INTEMG0_Handler
                Set_Default_Handler  INTOVV0_Handler
                Set_Default_Handler  INTPWM0_Handler
                Set_Default_Handler  INTT0RX_Handler
                Set_Default_Handler  INTT0TX_Handler
                Set_Default_Handler  INTT0ERR_Handler
                Set_Default_Handler  INTT1RX_Handler
                Set_Default_Handler  INTT1TX_Handler
                Set_Default_Handler  INTT1ERR_Handler
                Set_Default_Handler  INTT2RX_Handler
                Set_Default_Handler  INTT2TX_Handler
                Set_Default_Handler  INTT2ERR_Handler
                Set_Default_Handler  INTT3RX_Handler
                Set_Default_Handler  INTT3TX_Handler
                Set_Default_Handler  INTT3ERR_Handler
                Set_Default_Handler  INTT4RX_Handler
                Set_Default_Handler  INTT4TX_Handler
                Set_Default_Handler  INTT4ERR_Handler
                Set_Default_Handler  INTT5RX_Handler
                Set_Default_Handler  INTT5TX_Handler
                Set_Default_Handler  INTT5ERR_Handler
                Set_Default_Handler  INTT6RX_Handler
                Set_Default_Handler  INTT6TX_Handler
                Set_Default_Handler  INTT6ERR_Handler
                Set_Default_Handler  INTT7RX_Handler
                Set_Default_Handler  INTT7TX_Handler
                Set_Default_Handler  INTT7ERR_Handler
                Set_Default_Handler  INTT8RX_Handler
                Set_Default_Handler  INTT8TX_Handler
                Set_Default_Handler  INTT8ERR_Handler
                Set_Default_Handler  INTSMI0_Handler
                Set_Default_Handler  INTUART0RX_Handler
                Set_Default_Handler  INTUART0TX_Handler
                Set_Default_Handler  INTUART0ERR_Handler
                Set_Default_Handler  INTUART1RX_Handler
                Set_Default_Handler  INTUART1TX_Handler
                Set_Default_Handler  INTUART1ERR_Handler
                Set_Default_Handler  INTUART2RX_Handler
                Set_Default_Handler  INTUART2TX_Handler
                Set_Default_Handler  INTUART2ERR_Handler
                Set_Default_Handler  INTUART3RX_Handler
                Set_Default_Handler  INTUART3TX_Handler
                Set_Default_Handler  INTUART3ERR_Handler
                Set_Default_Handler  INTUART4RX_Handler
                Set_Default_Handler  INTUART4TX_Handler
                Set_Default_Handler  INTUART4ERR_Handler
                Set_Default_Handler  INTUART5RX_Handler
                Set_Default_Handler  INTUART5TX_Handler
                Set_Default_Handler  INTUART5ERR_Handler
                Set_Default_Handler  INTFUART0_Handler
                Set_Default_Handler  INTFUART1_Handler
                Set_Default_Handler  INTI2C0_Handler
                Set_Default_Handler  INTI2C0AL_Handler
                Set_Default_Handler  INTI2C0BF_Handler
                Set_Default_Handler  INTI2C0NACK_Handler
                Set_Default_Handler  INTI2C1_Handler
                Set_Default_Handler  INTI2C1AL_Handler
                Set_Default_Handler  INTI2C1BF_Handler
                Set_Default_Handler  INTI2C1NACK_Handler
                Set_Default_Handler  INTI2C2_Handler
                Set_Default_Handler  INTI2C2AL_Handler
                Set_Default_Handler  INTI2C2BF_Handler
                Set_Default_Handler  INTI2C2NACK_Handler
                Set_Default_Handler  INTI2C3_Handler
                Set_Default_Handler  INTI2C3AL_Handler
                Set_Default_Handler  INTI2C3BF_Handler
                Set_Default_Handler  INTI2C3NACK_Handler
                Set_Default_Handler  INTI2C4_Handler
                Set_Default_Handler  INTI2C4AL_Handler
                Set_Default_Handler  INTI2C4BF_Handler
                Set_Default_Handler  INTI2C4NACK_Handler
                Set_Default_Handler  INTADACP0_Handler
                Set_Default_Handler  INTADACP1_Handler
                Set_Default_Handler  INTADATRG_Handler
                Set_Default_Handler  INTADASGL_Handler
                Set_Default_Handler  INTADACNT_Handler
                Set_Default_Handler  INTADAHP_Handler
                Set_Default_Handler  INTFLDRDY_Handler
                Set_Default_Handler  INTFLCRDY0_Handler
                Set_Default_Handler  INTFLCRDY1_Handler
                Set_Default_Handler  Interrupt138_Handler
                Set_Default_Handler  INTMDMAABERR_Handler
                Set_Default_Handler  INTMDMAADERR_Handler


                .end